{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 48, 48], "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"kernel_regularizer": null, "filters": 32, "trainable": true, "name": "conv2d_1", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.2}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 32, "trainable": true, "name": "conv2d_2", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 64, "trainable": true, "name": "conv2d_3", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.2}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 64, "trainable": true, "name": "conv2d_4", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 128, "trainable": true, "name": "conv2d_5", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"seed": null, "name": "dropout_3", "noise_shape": null, "trainable": true, "rate": 0.2}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 128, "trainable": true, "name": "conv2d_6", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "size": [2, 2], "trainable": true, "name": "up_sampling2d_1"}, "name": "up_sampling2d_1", "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "name": "concatenate_1"}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 64, "trainable": true, "name": "conv2d_7", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"seed": null, "name": "dropout_4", "noise_shape": null, "trainable": true, "rate": 0.2}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 64, "trainable": true, "name": "conv2d_8", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "size": [2, 2], "trainable": true, "name": "up_sampling2d_2"}, "name": "up_sampling2d_2", "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "name": "concatenate_2"}, "name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 32, "trainable": true, "name": "conv2d_9", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"config": {"seed": null, "name": "dropout_5", "noise_shape": null, "trainable": true, "rate": 0.2}, "name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 32, "trainable": true, "name": "conv2d_10", "data_format": "channels_first", "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "filters": 2, "trainable": true, "name": "conv2d_11", "data_format": "channels_first", "kernel_size": [1, 1], "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"config": {"target_shape": [2, 2304], "trainable": true, "name": "reshape_1"}, "name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}, "name": "permute_1", "class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0, {}]]]}], "name": "model_1"}, "backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Model"}