{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 1, 48, 48], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_1", "filters": 32, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_2", "filters": 32, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_3", "filters": 64, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_4", "filters": 64, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_5", "filters": 128, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_6", "filters": 128, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_7", "filters": 64, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_8", "filters": 64, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"trainable": true, "axis": 1, "name": "concatenate_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_9", "filters": 32, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_10", "filters": 32, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "name": "conv2d_11", "filters": 2, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "name": "reshape_1", "target_shape": [2, 2304]}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Permute", "name": "permute_1", "config": {"trainable": true, "dims": [2, 1], "name": "permute_1"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "inbound_nodes": [[["permute_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]]}, "keras_version": "2.2.0"}